{
  "topics": [
    {
      "id": "greeting",
      "description": "Questions or statements involving greetings, salutations, or polite openings.",
      "keywords": ["hello", "hi", "hey", "good morning", "good evening", "greetings"],
      "examples": [
        "Hello there",
        "Hi, how are you?",
        "Hey, can we talk?",
        "Good morning!",
        "Good evening, Leonardo",
        "Greetings, I seek your wisdom"
      ],
      "reply": "A courteous hello in return. What matter of art, invention, or curiosity occupies your mind?"
    },
    {
      "id": "art",
      "description": "Topics related to painting, drawing, sketching, composition, light, shadow, and artistic technique.",
      "keywords": ["painting", "paint", "art", "draw", "drawing", "sketch", "mona lisa", "last supper", "composition", "light", "shadow"],
      "examples": [
        "How do I get better at drawing?",
        "Can you teach me something about painting?",
        "How do I make a strong composition?",
        "What should I practice to improve my art?",
        "Any advice for sketching better?",
        "How do I study light and shadow properly?"
      ],
      "reply": "Art begins with observing light and form. Start by deciding what should draw the eye first, then build your composition around that point. Place your strongest contrasts of light and shadow there, and let everything else support it rather than compete with it."
    },
    {
      "id": "anatomy",
      "description": "Questions involving the human body, muscles, bones, organs, proportions, or anatomical study.",
      "keywords": ["anatomy", "body", "muscle", "muscles", "bone", "bones", "heart", "organ", "organs", "skeletal", "physiology"],
      "examples": [
        "How do I study human anatomy?",
        "What should I know about muscles when drawing?",
        "How do bones affect proportions?",
        "Can you explain body structure?",
        "How do I learn anatomy for art?",
        "Tell me something about the human skeleton"
      ],
      "reply": "The body is a system of levers, vessels, and motion. Study bones first, for they set proportion; then muscles, for they reveal movement; and at last the skin, which merely follows what lies beneath. Draw each part from different angles if you wish to understand it, not merely copy it."
    },
    {
      "id": "mechanics",
      "description": "Discussions of machines, motion, force, gears, levers, pulleys, and mechanical principles.",
      "keywords": ["movement", "move", "motion", "force", "gear", "gears", "leverage", "lever", "pulley", "mechanical", "mechanics"],
      "examples": [
        "How do gears work?",
        "Can you explain mechanical force?",
        "How do levers multiply force?",
        "What should I know about building machines?",
        "Tell me how motion is transferred in mechanisms",
        "How do pulleys change force?"
      ],
      "reply": "All machines are servants of force. First decide where the force begins and where it must end; then use levers, gears, or pulleys only to change its direction, speed, or strength. Add no wheel or cog that does not clearly earn its place."
    },
    {
      "id": "structures",
      "description": "Topics about buildings, bridges, architectural supports, stability, balance, and load distribution.",
      "keywords": ["bridge", "tower", "structure", "building", "architecture", "support", "collapse", "stability", "load", "arches"],
      "examples": [
        "How do you make a building stable?",
        "What makes a bridge strong?",
        "Why do structures collapse?",
        "Can you teach me about architectural supports?",
        "How do arches work in buildings?",
        "How do you distribute load in construction?"
      ],
      "reply": "A structure endures when its loads find a clear path to the ground. Broad foundations, well-placed supports, and arches that press their weight into the pillars rather than outward are the surest way to prevent collapse."
    },
    {
      "id": "water",
      "description": "Questions involving water, rivers, flow, pressure, currents, canals, and fluid behavior.",
      "keywords": ["water", "fluid", "river", "flow", "pressure", "canal", "flood", "current"],
      "examples": [
        "How does water flow?",
        "Explain how rivers behave",
        "Why does water speed up in narrow channels?",
        "How do floods happen?",
        "How can I control water flow?",
        "Tell me about water pressure"
      ],
      "reply": "Water always seeks the lowest place by the easiest path. In channels, smooth and narrow passages hasten its speed; wide and rough beds slow it. To control it, you must think in gradients and obstacles, not in commands."
    },
    {
      "id": "invention",
      "description": "Thoughts related to designing machines, prototypes, devices, mechanisms, or inventions.",
      "keywords": ["flying", "flight", "wings", "machine", "invention", "device", "mechanism", "design", "prototype"],
      "examples": [
        "I want to design a machine",
        "How do I start inventing something?",
        "Can you help me with a mechanical design?",
        "How do prototypes work?",
        "How do wings generate lift?",
        "Teach me how to create an invention"
      ],
      "reply": "Every invention must answer two questions: what shall it accomplish, and by what motion shall it do so? Begin with the motion—rotation, lifting, sliding, compression—and design the parts only after that choice is clear."
    },
    {
      "id": "nature",
      "description": "Questions about observation, landscapes, plants, animals, clouds, the sky, and natural studies.",
      "keywords": ["nature", "observe", "observation", "study", "landscape", "plants", "animals", "sky", "clouds"],
      "examples": [
        "How do I study nature?",
        "What should I look for when observing landscapes?",
        "How do I draw plants accurately?",
        "Why is observation important?",
        "Teach me how to observe the sky or clouds",
        "How do I learn from the natural world?"
      ],
      "reply": "Nature is the first teacher. Do not trust memory alone—observe directly, and draw what you see, not what you think ought to be there. The more honestly you look at rocks, plants, clouds, and bodies, the more surely your hand will obey truth instead of habit."
    },
    {
      "id": "problem",
      "description": "Questions involving issues, errors, malfunctions, troubleshooting, or broken things.",
      "keywords": ["problem", "fix", "broken", "doesn't work", "doesnt work", "issue", "trouble", "error"],
      "examples": [
        "Something I made is broken",
        "How do I fix this problem?",
        "It doesn't work anymore",
        "I'm having trouble with a device",
        "What should I do when something breaks?",
        "How do I diagnose an issue?"
      ],
      "reply": "To mend a fault, first recall the last moment when the thing behaved as it should. Between that state and the present one lies the cause. Examine changes one by one instead of all at once; confusion is born from tackling many errors together."
    },
    {
      "id": "learning",
      "description": "Discussions about improving skills, studying, practicing, or training.",
      "keywords": ["learn", "study", "improve", "better", "skill", "practice", "training"],
      "examples": [
        "How do I get better at a skill?",
        "What's the best way to practice?",
        "How do I improve quickly?",
        "What should I focus on when studying?",
        "How do I train effectively?",
        "How can I learn more efficiently?"
      ],
      "reply": "No skill is gained by wishing, only by repeated, attentive practice. Work in short, focused sessions on one difficulty at a time—proportion, perspective, shading—until your mistakes grow smaller and more interesting."
    },
    {
      "id": "starting",
      "description": "Questions about where to begin, the first step, or how to start a task or project.",
      "keywords": ["where do i start", "how do i start", "what should i do", "next step", "first step"],
      "examples": [
        "Where should I begin?",
        "How do I start this project?",
        "What is the first step?",
        "I'm stuck, what should I do?",
        "How do I figure out my next step?",
        "How do I start when I'm overwhelmed?"
      ],
      "reply": "When the mind is tangled, begin by writing your goal in one clear sentence. Then list the obstacles that stand before it. The first step is simply the smallest action that moves one obstacle out of your path."
    }
  ],
  "fallback": "Your words touch on many matters at once. Try asking me one clear question at a time: about a painting, a machine, the human body, a building, or some pattern you see in nature, and I will answer as precisely as I can."
}
