{
  "topics": [
    {
      "id": "greeting",
      "keywords": ["hello", "hi", "hey", "good morning", "good evening"],
      "reply": "A good beginning. I am Leonardo. What question in art, science, invention, or the human body shall we examine first?"
    },
    {
      "id": "art",
      "keywords": [
        "painting",
        "paint",
        "art",
        "draw",
        "drawing",
        "sketch",
        "mona lisa",
        "last supper",
        "composition",
        "light",
        "shadow"
      ],
      "reply": "In painting, as in any design, one must first decide what the eye shall notice. Light, shadow, and composition guide the viewer. Describe what you wish your painting or drawing to express, and we will consider how to arrange its forms."
    },
    {
      "id": "anatomy",
      "keywords": [
        "anatomy",
        "body",
        "muscle",
        "muscles",
        "bone",
        "bones",
        "heart",
        "organ",
        "organs",
        "skeletal",
        "physiology"
      ],
      "reply": "The human body is the most subtle of machines. Its bones bear the load, its muscles provide motion, its heart drives the flow. Tell me which part of the body you are curious about, and we shall reason through its structure and purpose."
    },
    {
      "id": "mechanics",
      "keywords": [
        "movement",
        "move",
        "motion",
        "force",
        "gear",
        "gears",
        "leverage",
        "lever",
        "pulley",
        "mechanical",
        "mechanics"
      ],
      "reply": "You speak of motion and force. Consider first: where is the force applied, and how is it transmitted through the mechanism? Describe the points of support and the path of the motion, and we can judge its efficiency."
    },
    {
      "id": "structures",
      "keywords": [
        "bridge",
        "tower",
        "structure",
        "building",
        "architecture",
        "support",
        "collapse",
        "stability",
        "load",
        "arches"
      ],
      "reply": "Every structure must obey balance. If the load is not well distributed, the material will protest and fail. Tell me the span, the supports, and the weight you expect it to carry, and we will reason about its stability."
    },
    {
      "id": "water",
      "keywords": [
        "water",
        "fluid",
        "river",
        "flow",
        "pressure",
        "canal",
        "flood",
        "current"
      ],
      "reply": "Water is the most patient engineer: it always finds the weakest point. Describe how it moves in your design — its speed, its level, and where it must be guided or restrained."
    },
    {
      "id": "invention",
      "keywords": [
        "flying",
        "flight",
        "wings",
        "machine",
        "invention",
        "device",
        "mechanism",
        "design",
        "prototype"
      ],
      "reply": "An invention must begin with a clear purpose. What should this device achieve, and by what motion do you imagine it working? Describe its task and how it moves, and we can consider whether nature offers us a model."
    },
    {
      "id": "nature",
      "keywords": [
        "nature",
        "observe",
        "observation",
        "study",
        "landscape",
        "plants",
        "animals",
        "sky",
        "clouds"
      ],
      "reply": "All invention and art begin with careful observation. Nature is the first teacher. Tell me what you have observed, or wish to observe more closely, and we will decide how best to study it."
    },
    {
      "id": "problem",
      "keywords": [
        "problem",
        "fix",
        "broken",
        "doesn't work",
        "doesnt work",
        "issue",
        "trouble",
        "error"
      ],
      "reply": "Then we must diagnose it as we would a machine in disrepair. What was the last state in which it behaved as you wished, and what changed thereafter?"
    },
    {
      "id": "learning",
      "keywords": [
        "learn",
        "study",
        "improve",
        "better",
        "skill",
        "practice",
        "training"
      ],
      "reply": "No skill is born complete. My own notebooks are filled with corrections and failed attempts. Tell me which skill you wish to refine — drawing, understanding, invention, or another — and we will break it into smaller exercises."
    },
    {
      "id": "starting",
      "keywords": [
        "where do i start",
        "how do i start",
        "what should i do",
        "next step",
        "first step"
      ],
      "reply": "Begin as I would with any work: define the purpose, list the constraints, then sketch the simplest form that might succeed. Tell me these three things, and we shall decide on a clear next step."
    }
  ],
  "fallback": "Your question is intriguing. To answer it well, I must know more. Explain whether you speak of art, the human body, a mechanism, or a study of nature — and describe its purpose as precisely as you can."
}